// import * as echarts from 'echarts';
(function(){
  var chartDom = document.getElementById('number');
  var myChart = echarts.init(chartDom);
  var option;

  
  
  option = {
    grid: {
      top: '20%', // 设置图表的上间距 
      bottom: '20%', // 设置图表的下间距 
      left: '10%', // 设置图表的左间距 
      right: '10%' // 设置图表的右间距
    },
    tooltip:{
      // trigger: 'item',
    },
    xAxis: {
      type: 'value',
      name: '评分', 
      nameLocation: 'middle', // 设置 x 轴名称的位置 
      nameTextStyle: { 
        color: '#fff', // 修改 x 轴名称字体颜色 
        fontSize: 14, 
        padding: [6, 0, 0, 0] // 调整 x 轴名称与轴的距离 
      },
      min: 8.5, // 设置 x 轴的最小值 
      max: 10, // 设置 x 轴的最大值 
      interval: 0.5, // 设置 x 轴的间隔 
      axisLabel: { formatter: '{value}'},
      axisLabel: { 
        textStyle: { 
          color: '#fff' // 修改 x 轴字体颜色 
        } 
      }

    },
    yAxis: {
      type: 'value', 
      name: '评价人数（/10万）', 
      // nameLocation: 'middle', // 设置 x 轴名称的位置 
      nameTextStyle: { 
        color: '#fff', // 修改 x 轴名称字体颜色 
        fontSize: 14, 
        padding: [6, 0, 0, 70] // 调整 x 轴名称与轴的距离 
      },
      min: 0, // 设置 y 轴的最小值 
      max: 3500000, // 设置 y 轴的最大值 
      interval: 500000, // 设置 y 轴的间隔 
      axisLabel: { 
        formatter:function(value){return value/100000},
        textStyle: { 
          color: '#fff' // 修改 y 轴字体颜色 
        }  
      },
      // axisLabel: { 
      //   textStyle: { 
      //     color: '#fff' // 修改 y 轴字体颜色 
      //   } 
      // }
    },
    series: [
      {
        type: 'effectScatter',
        symbolSize: 10,
        data: [
          [172.7, 105.2],
          [153.4, 42]
        ]
      },
      {
        type: 'scatter',
        encode: { tooltip: [0, 1] },
        data: [
          [9.7, 3087928],
          [9.6, 2279265],
          [9.5, 2298552],
          [9.5, 2339296],
          [9.4, 2387673],
          [9.5, 1404685],
          [9.4, 2436102],
          [9.4, 2010939],
          [9.4, 2198233],
          [9.4, 1869038],
          [9.5, 1187547],
          [9.4, 1470052],
          [9.3, 1781788],
          [9.2, 1967967],
          [9.3, 1395828],
          [9.3, 1400981],
          [9.2, 2096895],
          [9.3, 1468094],
          [9.6, 640512],
          [9.2, 1622038],
          [9.3, 987231],
          [9.3, 1038277],
          [9.3, 1209461],
          [9.1, 1823863],
          [9.2, 1607160],
          [9.3, 960539],
          [9.2, 1342464],
          [9.2, 1314521],
          [9.1, 1945804],
          [9.3, 912235],
          [9.2, 1131852],
          [9.3, 858520],
          [9, 2233451],
          [9.3, 740318],
          [9.1, 1413378],
          [9.3, 734498],
          [9.1, 1188522],
          [9, 1813412],
          [9.4, 537409],
          [9.3, 700641],
          [9.1, 1110543],
          [9.1, 1121578],
          [9, 1658193],
          [9.2, 949635],
          [9.3, 671923],
          [9.1, 1422678],
          [9.3, 698523],
          [9.2, 806949],
          [9, 1291921],
          [9.1, 959436],
          [9.2, 805890],
          [8.9, 1774045],
          [9.4, 474886],
          [9.1, 1000264],
          [9.1, 893604],
          [9.1, 905433],
          [9.3, 596829],
          [9.2, 711767],
          [9.1, 905740],
          [9.2, 628169],
          [9.2, 671115],
          [9, 909590],
          [9, 1048692],
          [9.1, 816506],
          [9.2, 608202],
          [9.2, 602718],
          [8.9, 1207843],
          [9.1, 638125],
          [9.1, 645211],
          [8.8, 1363857],
          [8.9, 1040702],
          [9, 899550],
          [8.8, 1499674],
          [9.1, 688115],
          [8.9, 1238681],
          [9, 820761],
          [9.2, 438946],
          [9.1, 577926],
          [8.9, 958173],
          [8.9, 1017989],
          [8.9, 1005714],
          [8.9, 1050232],
          [8.9, 917169],
          [9, 772882],
          [9, 669836],
          [8.9, 901127],
          [9.3, 325371],
          [8.8, 1032315],
          [9, 674141],
          [9.3, 371303],
          [8.9, 891042],
          [8.9, 846755],
          [8.9, 780535],
          [9.1, 444878],
          [9.1, 447187],
          [9.1, 522186],
          [8.8, 916770],
          [8.8, 1000961],
          [8.7, 1156123],
          [9.1, 430830]
      ]
      }
    ]
  };
  
  option && myChart.setOption(option);
  window.addEventListener("resize", function() {
    myChart.resize();
  })
})()
